In [ ]:
# Exemplo de consultas sobre DataFrames con PySpark

In [2]:
# from pyspark import SparkContext

In [6]:
import pandas as pd

Cargar los datos

In [9]:
df = pd.read_csv('../datasets/purchases.txt',sep='\t')

Información del Dataset

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 971 entries, 0 to 970
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   2012-01-01      971 non-null    object
 1   09:00           971 non-null    object
 2   San Jose        971 non-null    object
 3   Men's Clothing  970 non-null    object
 4   214.05          970 non-null    float64
 5   Amex            970 non-null    object
dtypes: float64(1), object(5)
memory usage: 45.6+ KB

In [11]:
df.columns

Index(['2012-01-01', '09:00', 'San Jose', 'Men's Clothing', '214.05', 'Amex'], dtype='object')

In [13]:
nuevos_nombres = {
    '2012-01-01': 'data',
    '09:00': 'hora',
    'San Jose': 'tenda',
    "Men's Clothing": 'categoria',
    '214.05': 'venda',
    'Amex': 'pago'
}

In [54]:
df.columns

Index(['data', 'hora', 'tenda', 'categoria', 'venda', 'pago'], dtype='object')

In [14]:
# Cambiar los nombres de las columnas utilizando el diccionario
df = df.rename(columns=nuevos_nombres)

In [16]:
df.head()

         data   hora       tenda            categoria   venda        pago
0  2012-01-01  09:00  Fort Worth     Women's Clothing  153.57        Visa
1  2012-01-01  09:00   San Diego                Music   66.08        Cash
2  2012-01-01  09:00  Pittsburgh         Pet Supplies  493.51    Discover
3  2012-01-01  09:00       Omaha  Children's Clothing  235.63  MasterCard
4  2012-01-01  09:00    Stockton       Men's Clothing  247.18  MasterCard

In [26]:
# Seleccionar tanda, categoria e venda
seleccion = df[['tenda', 'categoria', 'venda']]
seleccion

          tenda            categoria   venda
0    Fort Worth     Women's Clothing  153.57
1     San Diego                Music   66.08
2    Pittsburgh         Pet Supplies  493.51
3         Omaha  Children's Clothing  235.63
4      Stockton       Men's Clothing  247.18
..          ...                  ...     ...
966     Madison                  CDs  459.03
967      Denver                 Toys  263.96
968       Boise                  CDs  147.33
969    New York               Crafts  338.06
970          Da                  NaN     NaN

[971 rows x 3 columns]

In [28]:
# Mostrar datos da tenda de San José
tienda = df[df['tenda'] == 'San Jose']
tienda

           data   hora     tenda            categoria   venda        pago
16   2012-01-01  09:00  San Jose     Women's Clothing  215.82        Cash
208  2012-01-01  09:09  San Jose                 Toys  337.71        Cash
375  2012-01-01  09:17  San Jose               Garden  192.82        Cash
408  2012-01-01  09:19  San Jose              Cameras   95.81        Cash
409  2012-01-01  09:19  San Jose         Pet Supplies  253.33    Discover
425  2012-01-01  09:20  San Jose            Computers  160.60        Amex
433  2012-01-01  09:20  San Jose              Cameras  285.57  MasterCard
464  2012-01-01  09:22  San Jose                  CDs  250.46        Cash
498  2012-01-01  09:24  San Jose                 DVDs  204.88        Visa
569  2012-01-01  09:27  San Jose  Children's Clothing  136.12  MasterCard
672  2012-01-01  09:32  San Jose       Sporting Goods  422.91  MasterCard

In [29]:
# Mostra por pantalla os datos das vendas pagadas con 'MasterCard'
pago = df[df['pago'] == 'MasterCard']
pago

           data   hora       tenda            categoria   venda        pago
3    2012-01-01  09:00       Omaha  Children's Clothing  235.63  MasterCard
4    2012-01-01  09:00    Stockton       Men's Clothing  247.18  MasterCard
11   2012-01-01  09:00      Austin              Cameras  469.63  MasterCard
12   2012-01-01  09:00  Greensboro                 DVDs  290.82  MasterCard
32   2012-01-01  09:01   Anchorage                Music  298.86  MasterCard
..          ...    ...         ...                  ...     ...         ...
945  2012-01-01  09:45    Honolulu            Computers  407.51  MasterCard
947  2012-01-01  09:45     Madison                  CDs  302.82  MasterCard
960  2012-01-01  09:45     Houston                 Toys  291.42  MasterCard
963  2012-01-01  09:46    New York       Sporting Goods   81.40  MasterCard
964  2012-01-01  09:46   Arlington       Men's Clothing   44.39  MasterCard

[184 rows x 6 columns]

In [30]:
# Datos das vendas maiores de 200 compradas con MasterCard
venda = df[(df['venda'] > 200) & (df['pago'] == 'MasterCard')]
venda

           data   hora          tenda            categoria   venda        pago
3    2012-01-01  09:00          Omaha  Children's Clothing  235.63  MasterCard
4    2012-01-01  09:00       Stockton       Men's Clothing  247.18  MasterCard
11   2012-01-01  09:00         Austin              Cameras  469.63  MasterCard
12   2012-01-01  09:00     Greensboro                 DVDs  290.82  MasterCard
32   2012-01-01  09:01      Anchorage                Music  298.86  MasterCard
..          ...    ...            ...                  ...     ...         ...
931  2012-01-01  09:44  Oklahoma City     Women's Clothing  474.29  MasterCard
933  2012-01-01  09:44        Anaheim                Books  347.60  MasterCard
945  2012-01-01  09:45       Honolulu            Computers  407.51  MasterCard
947  2012-01-01  09:45        Madison                  CDs  302.82  MasterCard
960  2012-01-01  09:45        Houston                 Toys  291.42  MasterCard

[118 rows x 6 columns]

In [31]:
df.count()

data         971
hora         971
tenda        971
categoria    970
venda        970
pago         970
dtype: int64

In [32]:
df.shape

(971, 6)

In [48]:
# Contar el número de compras por tenda
compras_por_tenda = df.groupby('tenda').size().reset_index(name='count')
compras_por_tenda

              tenda  count
0       Albuquerque     11
1           Anaheim     10
2         Anchorage     13
3         Arlington      8
4           Atlanta     10
..              ...    ...
99            Tulsa      8
100  Virginia Beach      7
101      Washington      7
102         Wichita      9
103   Winston–Salem      9

[104 rows x 2 columns]

In [49]:
# Contar el número de compras por tenda y ordenar por el conteo
compras_por_tenda_ordenado = df.groupby('tenda').size().reset_index(name='count').sort_values(by='count')
compras_por_tenda_ordenado

              tenda  count
24               Da      1
38        Henderson      4
71          Orlando      4
67  North Las Vegas      5
93        St. Louis      5
..              ...    ...
46      Jersey City     14
47      Kansas City     14
37       Greensboro     14
90       Scottsdale     17
64         New York     18

[104 rows x 2 columns]

In [47]:
# Convertir el tipo de la columna 'venda' a float
df['venda'] = df['venda'].astype(float)
df.dtypes

data          object
hora          object
tenda         object
categoria     object
venda        float64
pago          object
dtype: object

In [44]:
# Calcular la suma de 'venda' por tenda, suma de las ventas de cada tienda
suma_vendas_por_tenda = df.groupby('tenda')['venda'].sum().reset_index(name='total_vendas')
suma_vendas_por_tenda

              tenda  total_vendas
0       Albuquerque       2915.06
1           Anaheim       2566.10
2         Anchorage       2866.98
3         Arlington       1661.22
4           Atlanta       2399.51
..              ...           ...
99            Tulsa       1441.00
100  Virginia Beach       1505.04
101      Washington       1481.72
102         Wichita       2306.47
103   Winston–Salem       2293.16

[104 rows x 2 columns]

In [46]:
# Contar el número de vendas por tipo de pago
vendas_por_pago = df.groupby('pago').size().reset_index(name='count')
vendas_por_pago

         pago  count
0        Amex    185
1        Cash    188
2    Discover    195
3  MasterCard    184
4        Visa    218

In [52]:
# Encontrar la venta más alta para cada tipo de pago
max_venda_por_pago = df.groupby('pago')['venda'].max().reset_index(name='venda_mas_alta')
max_venda_por_pago

         pago  venda_mas_alta
0        Amex          498.32
1        Cash          499.55
2    Discover          498.93
3  MasterCard          496.04
4        Visa          497.17

In [53]:
# Calcular el total de vendas y el número de vendas por tipo de pago
total_e_numero_vendas_por_pago = df.groupby('pago').agg({'venda': ['sum', 'count']}).reset_index()
total_e_numero_vendas_por_pago.columns = ['pago', 'total_vendas', 'numero_vendas']
total_e_numero_vendas_por_pago

         pago  total_vendas  numero_vendas
0        Amex      42595.24            185
1        Cash      48522.95            188
2    Discover      50426.45            195
3  MasterCard      46063.52            184
4        Visa      51686.09            218

ejemplo spark a partir de aquí

In [ ]:
# Cargar dataset
compras = spark.read.csv('purchases.txt',sep='\t')
compras.show()

In [ ]:
# Mostrar el esquema del DataFrame
compras.printSchema()

In [ ]:
# Podemos aplicarlle nomes ás columnas
compras = compras.toDF('data','hora','tenda','categoria','venda','pago')
compras.show()

In [ ]:
# Seleccionar tanda, categoria e venda
compras.select('tenda','categoria','venda').show()

In [ ]:
# Mostrar datos da tenda de San José
compras.filter(compras['tenda'] == 'San Jose').show()

In [ ]:
# Mostra por pantalla os datos das vendas pagadas con 'MasterCard'
compras.filter(compras['pago'] == 'MasterCard').show()

In [ ]:
# Datos das vendas maiores de 200 compradas con MasterCard
compras.filter((compras['venda'] > 200) & (compras['pago'] == 'MasterCard')).show()

In [ ]:
# Conta o número de liñas
compras.count()

In [ ]:
# Contar o número de compras por tenda
compras.groupBy('tenda').count().show()

In [ ]:
compras.groupBy('tenda').count().sort('count').show()

In [ ]:
# Calcular o total de vendas (suma) por tenda

#compras.groupBy('tenda').sum('venda').show()

# O código anterior fallaría debido ao tipo "string" de 'venda'

In [ ]:
compras.printSchema()

In [ ]:
# Existen múltiples formas de modificar o schema dun DataFrame
# Esta sería unha delas
compras = compras.withColumn('venda',compras['venda'].cast('float').alias('venda'))

In [ ]:
compras.printSchema()

In [ ]:
# O mesmo código de antes agora si funciona
compras.groupBy('tenda').sum('venda').show()

In [ ]:
# Número de vendas por tipo de pago
compras.groupBy('pago').count().show()

In [ ]:
# Venda mais alta para cada tipo de pago
compras.groupBy('pago').max('venda').show()

In [ ]:
# Total de vendas e número de vendas por tipo de pago (indicando tamén o tipo de pago)
grupo_pago = compras.groupBy('pago')
type(grupo_pago)
grupo_pago.agg({"venda":"count","venda":"sum"}).show()